//=============================**** [제공 코드] (기본 함수는 수정 가능 / 그 외에는 안 건드리는 게 좋아요 화이팅!!) ****===================================================================================================================================================================================
//==================================================================================================================================================================================================================================

//include===================================================================================================================================================================================================================================
#include <Wire.h>
#include "Adafruit_TCS34725.h"
#include <DynamixelShield.h>

//<init>===================================================================================================================================================================================================================
//dynamixel init----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

#if defined(ARDUINO_AVR_UNO) || defined(ARDUINO_AVR_MEGA2560)
#include <SoftwareSerial.h>
SoftwareSerial soft_serial(52, 53);  // RX, TX
#define DEBUG_SERIAL soft_serial
#elif defined(ARDUINO_SAM_DUE) || defined(ARDUINO_SAM_ZERO)
#define DEBUG_SERIAL SerialUSB
#else
#define DEBUG_SERIAL Serial
#endif


using namespace ControlTableItem;

int DXL_L_ID = 1;
int DXL_R_ID = 2;
float DXL_PROTOCOL_VERSION = 2.0;
DynamixelShield dxl;

// RGB센서 init---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// TCS34725 센서 초기화
Adafruit_TCS34725 tcs = Adafruit_TCS34725(TCS34725_INTEGRATIONTIME_50MS, TCS34725_GAIN_1X);

// IR센서 init--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
int IR_num = 5;  //IR 개수 5개라는 뜻
//       (좌) [0] [1] [2] [3] [4] (우)
int IR[5] = { 32, 34, 36, 38, 40 };  // IR센서 각 핀 번호 정의한건데 몰라도 됨
int IRval[5]; // IR 센서 반환된 값 [1이면 검정색 인식 / 0이면 흰색 인식임] IRval[0] ~ IRval[4]까지 각 IR 인식된 값 들어감

// LED ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
int LED_R = 8;
int LED_G = 9;
int LED_B = 10;

//초음파 init-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
int Ultra_num = 4; // 초음파 개수
//             [0] [1]  [2] [3]  //fl,fr,br,bl 순 (f:front / b:back / r:right / l:left)
int echo[4] = { 23, 25, 27, 29 };
int trig[4] = { 22, 24, 26, 28 };

//=============================================[함수 선언]============================================================================================================================================================================
// 기본 제공 함수
void move(float left_speed, float right_speed);
void readIR();
int readColor();
float Distance(int echo_pin);

// setup()=========================================================================================================================================================================================================================
void setup() {
  //dynamixel setup [안봐도 됨]
  dxl.begin(57600);

  dxl.setPortProtocolVersion(DXL_PROTOCOL_VERSION);

  dxl.ping(DXL_L_ID);
  dxl.ping(DXL_R_ID);

  dxl.torqueOff(DXL_L_ID);
  dxl.torqueOff(DXL_R_ID);

  dxl.setOperatingMode(DXL_L_ID, OP_VELOCITY);
  dxl.setOperatingMode(DXL_R_ID, OP_VELOCITY);

  dxl.torqueOn(DXL_L_ID);
  dxl.torqueOn(DXL_R_ID);

  // IR setup 
  for (int i = 0; i < IR_num; i++) {
    pinMode(IR[i], INPUT);
  }

  // LED setup 
  for (int i = 8; i <= 10; i++) pinMode(i, OUTPUT); // 8(r) 9(g) 10(b)

  // Ultrasonic setup 
  for (int i = 0; i < 4; i++) { 
    pinMode(echo[i], INPUT);
    pinMode(trig[i], OUTPUT);
  }


  //RGB check   [그냥 RGB센서 잘 인식되나 확인하는 코드 (안봐도 됨)]
  if (tcs.begin()) {
    Serial.println("Found sensor");
  } else {
    Serial.println("No TCS34725 found ... check your connections");
    while (1)
      ;
  }
}

//=========[센서 관련 함수정의]============================================================================================================================================================================================================================

// 1.모터 속도 제어 
// 사용 예시) move(50, 50): 전진 / move(-50, -50) : 후진 / move(50, -50) : 우회전 / move(-50, 50) : 좌회전
// 각 모터 속도 범위는 30~60으로 권장 
void move(float left_speed, float right_speed) {
  dxl.setGoalVelocity(DXL_L_ID, left_speed, UNIT_RPM);
  dxl.setGoalVelocity(DXL_R_ID, -right_speed, UNIT_RPM);
}
// 2. IR 센서 값 읽기 -> IRval[0](좌)~IRval[4](우). 값 : 1(흑) / 0(백)
void readIR() {
  for (int i = 0; i < IR_num; i++) {
    IRval[i] = digitalRead(IR[i]);
  }
}

// 3. RGB 센서 값 읽기 -> int형으로 색깔 반환
int readColor() {
  int r, g, b, c;
  int whatcolor = -1;  // 0빨, 1초, 2파, -1초기값

  tcs.getRawData(&r, &g, &b, &c);

  // 각 색상의 비율 계산
  float ratio_r = ((float)r / (float)c) * 100.0;
  float ratio_g = ((float)g / (float)c) * 100.0;
  float ratio_b = ((float)b / (float)c) * 100.0;

  // 각 색상의 비율이 40%이상이며 다른 색 비율보다 큰 경우, 해당 색상이라고 인식. 환경에 따라 비율 바꿔보며 테스트해보기
  if (ratio_r > 40.0 && ratio_r > ratio_b && ratio_r > ratio_g) whatcolor = 0;
  else if (ratio_g > 40.0 && ratio_g > ratio_b && ratio_g > ratio_r) whatcolor = 1;
  else if (ratio_b > 40.0 && ratio_b > ratio_r && ratio_b > ratio_g) whatcolor = 2;
  else whatcolor = -1;

  return whatcolor;
}

// 4. 초음파 센서 값 읽기 -> cm 단위로 변환해서 float형으로 반환
float Distance(int echo_pin) {
  float cycletime;
  float dist;
  digitalWrite(echo_pin - 1, LOW);
  delayMicroseconds(2);
  digitalWrite(echo_pin - 1, HIGH);
  delayMicroseconds(10);
  digitalWrite(echo_pin - 1, LOW);

  cycletime = pulseIn(echo_pin, HIGH, 30000);
  if (cycletime == 0) return -1;
  dist = ((340.0 * cycletime) / 10000.0) / 2.0;
  return dist;
}

//===============================**** [제공 코드 끝] ****====================================================================================================================================================================================
//========== [setup 자체가 수정 금지된 것이 아닙니다. 다른 코드는 자유롭게 추가 작성하셔도 됩니다.]===========================================================================================================================
//====================================================================================================================================================================================================================================

// loop()==============**** [목적에 맞게 코딩하세요] ****===========================================================================================================================================================================================
void loop() {

}
